# 타이타닉 생존자 예측

In [4]:
import numpy as np 
import pandas as pd

In [5]:
titanic_df = pd.read_csv('../00.data/titanic/train.csv')
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
 ## 결손치(Nan/Null) 처리

In [13]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Age'].mean()

29.69911764705882

In [15]:
titanic_df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [17]:
titanic_df['Embarked'].fillna('N', inplace = True)

In [18]:
## 불필요한 컬럼 삭제하기

In [20]:
titanic_df.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis =1, inplace=True)
titanic_df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

## 문자열 처리

In [21]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
titanic_df['Sex'] = le.fit_transform(titanic_df['Sex'])
titanic_df['Embarked'] = le.fit_transform(titanic_df['Embarked'])
titanic_df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         3
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         3
3         1       1    0  35.0      1      0  53.1000         3
4         0       3    1  35.0      0      0   8.0500         3

In [24]:

y = titanic_df['Survived']
X = titanic_df[['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked']]
X.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         3
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         3
3       1    0  35.0      1      0  53.1000         3
4       3    1  35.0      0      0   8.0500         3

In [25]:
X1 = titanic_df.iloc[:, 1:]
X1.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         3
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         3
3       1    0  35.0      1      0  53.1000         3
4       3    1  35.0      0      0   8.0500         3

In [26]:
X2 = titanic_df.drop(['Survived'], axis=1)
X2.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         3
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         3
3       1    0  35.0      1      0  53.1000         3
4       3    1  35.0      0      0   8.0500         3

In [ ]:
## 자율학습

In [49]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

In [62]:
X_train, X_test, y_train, y_test = train_test_split(X1,y, test_size=0.2, random_state=789)

In [63]:
dt_clf = DecisionTreeClassifier(random_state=2021)
dt_clf.fit(X_train, y_train)

DecisionTreeClassifier(random_state=2021)

In [64]:
from sklearn.metrics import accuracy_score

In [65]:
pred = dt_clf.predict(X_test)
accuracy_score(y_test, pred)

0.7988826815642458

In [66]:
from sklearn.model_selection import GridSearchCV

In [70]:
parameters = {'max_depth':[2,3,4], 'min_samples_split':[2,3]}

In [72]:
grid_dtree = GridSearchCV(
    dt_clf, param_grid=parameters, scoring='accuracy', cv=3, refit=True
)

In [73]:
grid_dtree.fit(X_train, y_train)

GridSearchCV(cv=3, estimator=DecisionTreeClassifier(random_state=2021),
             param_grid={'max_depth': [2, 3, 4], 'min_samples_split': [2, 3]},
             scoring='accuracy')

In [42]:
scores_df = pd.DataFrame(grid_dtree.cv_results_)
scores_df[['params', 'mean_test_score', 'rank_test_score',
 'split0_test_score', 'split1_test_score', 'split2_test_score']]

,params,mean_test_score,rank_test_score,split0_test_score,split1_test_score,split2_test_score
0,"{'max_depth': 2, 'min_samples_split': 2}",0.794927,5,0.806723,0.793249,0.784810
1,"{'max_depth': 2, 'min_samples_split': 3}",0.794927,5,0.806723,0.793249,0.784810
2,"{'max_depth': 3, 'min_samples_split': 2}",0.823027,1,0.827731,0.852321,0.789030
3,"{'max_depth': 3, 'min_samples_split': 3}",0.823027,1,0.827731,0.852321,0.789030
4,"{'max_depth': 4, 'min_samples_split': 2}",0.815995,3,0.827731,0.818565,0.801688
5,"{'max_depth': 4, 'min_samples_split': 3}",0.815995,3,0.827731,0.818565,0.801688

In [75]:
grid_dtree.best_params_

{'max_depth': 4, 'min_samples_split': 2}

In [76]:
grid_dtree.best_score_

0.7921379522273044

In [77]:
estimator = grid_dtree.best_estimator_
pred = estimator.predict(X_test)
accuracy_score(y_test, pred)

0.8547486033519553